package 集合练习;

public class 数据结构了解 {
	public static void main(String []args) {
		
//		数据结构是计算机底层存储 组织数据的方式
//		是指数据相互之间是以什么方式排列在一起的
//		是为了更方便的管理和使用数据,需要结合具体的业务场景来选择
//		
//		每种数据结构长什么样子
//		如何添加数据
//		如何删除数据
		
//		数据结构(栈)：   后进先出 先进后出 可以理解为弹匣里的子弹
//		数据结构(队列)：先进先出 后进后出 可以理解为排队买票
//		数据结构(数组)：查询速度快（通过地址值和索引定位，元素在内存中是连续存储的）
//		查询快增删慢      删除效率低（要把原始数据删除，同时后面每个数据前移）
//		                            添加效率极低（添加位置后每个数据后移，再添加元素）
//		数据结构(链表)：链表里面的每一个元素称之为结点，每一个结点都是独立的对象
//		                            在内存中是不连续的，每个结点包含数据值和下一个结点的地址
//		                            添加一个数据的方法就是在上一个结点内部指向下一个结点的地址
//		                            链表查询速度慢，无论查询哪个数据都要从头开始
//		                            链表增删速度快（相对数组）
//		                            实际上还有单向链表和双向链表的区别
		
	}
}
